package com.telran.prof.lessonthirty.producerconsumer;

public class HW {

    public static void main(String[] args) {
        //1) написать поиск линеный поиск элемента в массиве из 100000
        // в несколько потоков ( сравнить время при одном потоке и нескольких)

        //2) Создать массив их 100000 посчитать сумму элементов массива
        // в одном потоке , в двух потоках - сравнить время

        //3) Повторить продюсер - консьюмер на очереди из 100 элементов
        // с тремя продюсерами и 5 консюмерами
    }
}
