package com.telran.prof.lessons.lessonsone;


// Клас это некий чертеж на основании которого мы создаем объект
// К класу относится определение шаблон описатель общих свойств
// Класс описывает свойства (состояние ) объекта и поведение объекта (методы)
// Объект - это екземпляр класса
public class Dog {
    // состояние нашей собаки : возраст , порода , кличка
    // поведение собаки : лаять, кусаться , есть

    String name;

    int age;

    String breed;

    void  bark(){

    }

    void  beat(){

    }

    void  eat(){

    }
}
