package com.telran.prof.lessoons.hw.hw15;

public class HW {

    public static void main(String[] args) {
        //1) написать линейный поиск элемента в массиве из 100000
        // в несколько потоков (сравнить время при одном потоке и нескольких)

        //2) создать массив из 100000 посчитать сумму элементов массива
        // в одном потоке, в двух потоках - сравнить время

        //3) повторить продюсер - консьюмер на очереди из 100 элементов
        // с тремя продюсерами и 5 консьюмерами
    }
}
