package com.telran.base.lesson11;

/**
 * Класс это шаблон для построения объекта, можно сказать что это чертеж
 * по которому будет создан объект
 * Описатель общих свойств объекта
 *
 * Классы и Объекты: Классы это набор файлов в нашем проекте, а объекты
 * это то, мы создаем на основе этих файлов через слово new
 *
 * Класс - это чертеж автомобиля, где указаны его свойства и параметры
 * Объект - это реальный автомобиль, построенный по этому чертежу
 *
 * Объекты - это экземпляры какого то класса
 *
 * На основании одного класса можно построить много объектов с различными характеристиками
 *
 * <модификатор> доступа class <имя класса>
 * public                class Example {
 *       <тело класса>
 * }
 *
 */
public class Example {

    //Элементы данных *

    //Методы (поведение, которым обладает наш объект)

    //Конструкторы *

    //вложенные классы

}
