// Путь к вашему классу - структура пакетов до вашего класса
package com.telran.base.lesson2;

//сигнатура класса (public - модификатор доступа, class - тип, Example - имя класса)
//Полный путь до класса Example : com.telran.base.lesson2.Example
public class Example {
    // тело класса - это то что находится между {}
    // переменные и методы
    // переменные нужны что бы хранить какие-то данные(свойства объекта)
    // методы нужны что бы хранить там написанный код(мы пишем код который показывает
    // что умеет делать ваш класс)
    // метод - кроме кода тоже содержит переменные , которые нужны для работы
    // кода внутри метода

    //Класс это шаблон, которые описывает какими свойствами и методами(поведением)
    //может обладать объект, который мы создадим на основании этого класса
}
