package com.telran.prof.lessons.lesson1;

//класс это некий чертеж на основании которого, мы создаем объект
//к классу относится определение шаблон, описание общих свойств объектов
//Класс описывает свойства (состояние) объекта и поведение объекта(методы)
//Объект - это экземпляр класса
public class Dog {
    //состояние этой собаки: возраст, порода, кличка
    //поведение этой собаки: лаять, кусать, есть

    String name;

    int age;

    String breed;

    void bark() {

    }

    void beat() {

    }

    void eat() {
    }
}
