package com.telran.prof.lessontwentyone;

/**
 * Создать файл story.txt c небольшой историей из 3х строк
 * Считать этой файл побайтово
 * И сделать из каждого считанного байта -символ
 * (StringBuilder)
 * а из всех символов сделать строку и вывести ее один раз в консоль
 *
 * HOMEWORK :
 * Считать файл, кодировать его уменьшением байта на 1 значение и записать
 * и наоборот считать кодированный файл и декодировать его
 * App, Encoder, Decoder : Converter -> decode, encode !ISP!
 */
public class Task {
}
