package com.telran.base.lesson5;

/**
 * if - если условие истинно, то нужно что-то сделать
 * if-else - если условие истинно, то нужно что-то сделать,
 * иначе, если условие ложь, то нужно сделать что-то другое
 *
 * if-else-if если условие истинно, то нужно что-то сделать,
 *  иначе, если условие ложь, то нужно сделать что-то другое,
 *  а этим другим будет еще одно условие
 *
 * nested if - внутри одного условия находится другое условие
 *
 * instruction return - внутри условия можно использовать оператор
 * возврата, что бы прервать выполнения кода условия
 */
public class Theory {
}
